import path from 'path'
import fs from 'fs'

// ============================================================
// 📦📋 包信息
// ============================================================

export const pkg: Record<string, any> = JSON.parse(
  fs.readFileSync(path.resolve(__dirname, '../package.json'), 'utf-8')
)

// ============================================================
// 🖼️🎨 图片格式与风格
// ============================================================

//图片风格
export const IMAGE_STYLES = {
  THICK_WHITE_BACKGROUND: '厚实白色背景',
  SEMI_TRANSPARENT_FROSTED_GLASS: '半透明磨砂玻璃',
} as const;

//图片格式
export const IMAGE_TYPES = {
  PNG: 'png',
  JPEG: 'jpeg',
  WEBP: 'webp',
} as const;

export type ImageType = typeof IMAGE_TYPES[keyof typeof IMAGE_TYPES];

// ============================================================
// 🗺️📌 光翼映射表 (from https://s.166.net/config/ds_yy_02/ma75_wing_wings.json)
// 2026-02-15
// ============================================================

export type WingMapItem = {
  "光翼名字": string;
  "一级标签": string;
  "二级标签": string;
};

export const WingTagMap = [
  // no.1
  { "光翼名字": "l_Credits_0", "一级标签": "暴风眼", "二级标签": "重生门" },
  // no.2
  { "光翼名字": "l_Storm_0", "一级标签": "暴风眼", "二级标签": "" },
  // no.3
  { "光翼名字": "l_Storm_1", "一级标签": "暴风眼", "二级标签": "" },
  // no.4
  { "光翼名字": "l_Storm_2", "一级标签": "暴风眼", "二级标签": "" },
  // no.5
  { "光翼名字": "l_Storm_3", "一级标签": "暴风眼", "二级标签": "" },
  // no.6
  { "光翼名字": "l_Storm_4", "一级标签": "暴风眼", "二级标签": "" },
  // no.7
  { "光翼名字": "l_Storm_5", "一级标签": "暴风眼", "二级标签": "" },
  // no.8
  { "光翼名字": "l_Storm_6", "一级标签": "暴风眼", "二级标签": "" },
  // no.9
  { "光翼名字": "l_Storm_7", "一级标签": "暴风眼", "二级标签": "" },
  // no.10
  { "光翼名字": "l_Storm_8", "一级标签": "暴风眼", "二级标签": "" },
  // no.11
  { "光翼名字": "l_StormStart_0", "一级标签": "暴风眼", "二级标签": "" },
  // no.12
  { "光翼名字": "l_Dawn_0", "一级标签": "晨岛", "二级标签": "" },
  // no.13
  { "光翼名字": "l_Dawn_1", "一级标签": "晨岛", "二级标签": "" },
  // no.14
  { "光翼名字": "l_Dawn_2", "一级标签": "晨岛", "二级标签": "" },
  // no.15
  { "光翼名字": "l_Dawn_3", "一级标签": "晨岛", "二级标签": "" },
  // no.16
  { "光翼名字": "l_Dawn_4", "一级标签": "晨岛", "二级标签": "" },
  // no.17
  { "光翼名字": "l_Dawn_TrialsAir_0", "一级标签": "晨岛", "二级标签": "预言季" },
  // no.18
  { "光翼名字": "l_Dawn_TrialsEarth_0", "一级标签": "晨岛", "二级标签": "预言季" },
  // no.19
  { "光翼名字": "l_Dawn_TrialsFire_0", "一级标签": "晨岛", "二级标签": "预言季" },
  // no.20
  { "光翼名字": "l_Dawn_TrialsWater_0", "一级标签": "晨岛", "二级标签": "预言季" },
  // no.21
  { "光翼名字": "l_Dawn_5", "一级标签": "晨岛", "二级标签": "" },
  // no.22
  { "光翼名字": "l_Night2_3", "一级标签": "禁阁", "二级标签": "" },
  // no.23
  { "光翼名字": "l_Night_0", "一级标签": "禁阁", "二级标签": "" },
  // no.24
  { "光翼名字": "l_Night_1", "一级标签": "禁阁", "二级标签": "" },
  // no.25
  { "光翼名字": "l_Night2_0", "一级标签": "禁阁", "二级标签": "" },
  // no.26
  { "光翼名字": "l_Night2_1", "一级标签": "禁阁", "二级标签": "" },
  // no.27
  { "光翼名字": "l_Night2_2", "一级标签": "禁阁", "二级标签": "" },
  // no.28
  { "光翼名字": "l_NightArchive_0", "一级标签": "禁阁", "二级标签": "" },
  // no.29
  { "光翼名字": "l_NightArchive_1", "一级标签": "禁阁", "二级标签": "" },
  // no.30
  { "光翼名字": "l_Dusk_0", "一级标签": "暮土", "二级标签": "" },
  // no.31
  { "光翼名字": "l_Dusk_1", "一级标签": "暮土", "二级标签": "" },
  // no.32
  { "光翼名字": "l_Dusk_CrabField_0", "一级标签": "暮土", "二级标签": "" },
  // no.33
  { "光翼名字": "l_Dusk_CrabField_1", "一级标签": "暮土", "二级标签": "" },
  // no.34
  { "光翼名字": "l_Dusk_CrabField_2", "一级标签": "暮土", "二级标签": "" },
  // no.35
  { "光翼名字": "l_DuskEnd_0", "一级标签": "暮土", "二级标签": "" },
  // no.36
  { "光翼名字": "l_DuskGraveyard_0", "一级标签": "暮土", "二级标签": "" },
  // no.37
  { "光翼名字": "l_DuskGraveyard_1", "一级标签": "暮土", "二级标签": "" },
  // no.38
  { "光翼名字": "l_DuskGraveyard_2", "一级标签": "暮土", "二级标签": "" },
  // no.39
  { "光翼名字": "l_DuskGraveyard_3", "一级标签": "暮土", "二级标签": "" },
  // no.40
  { "光翼名字": "l_DuskGraveyard_4", "一级标签": "暮土", "二级标签": "" },
  // no.41
  { "光翼名字": "l_DuskGraveyard_5", "一级标签": "暮土", "二级标签": "" },
  // no.42
  { "光翼名字": "l_DuskMid_0", "一级标签": "暮土", "二级标签": "" },
  // no.43
  { "光翼名字": "l_DuskMid_1", "一级标签": "暮土", "二级标签": "" },
  // no.44
  { "光翼名字": "l_DuskOasis_0", "一级标签": "暮土", "二级标签": "魔法季" },
  // no.45
  { "光翼名字": "l_DuskOasis_1", "一级标签": "暮土", "二级标签": "魔法季" },
  // no.46
  { "光翼名字": "l_Sunset_YetiPark_0", "一级标签": "霞谷", "二级标签": "梦想季" },
  // no.47
  { "光翼名字": "l_Sunset_YetiPark_1", "一级标签": "霞谷", "二级标签": "梦想季" },
  // no.48
  { "光翼名字": "l_SunsetColosseum_0", "一级标签": "霞谷", "二级标签": "" },
  // no.49
  { "光翼名字": "l_SunsetVillage_0", "一级标签": "霞谷", "二级标签": "梦想季" },
  // no.50
  { "光翼名字": "l_SunsetVillage_1", "一级标签": "霞谷", "二级标签": "梦想季" },
  // no.51
  { "光翼名字": "l_SunsetVillage_2", "一级标签": "霞谷", "二级标签": "梦想季" },
  // no.52
  { "光翼名字": "l_Sunset_0", "一级标签": "霞谷", "二级标签": "" },
  // no.53
  { "光翼名字": "l_Sunset_1", "一级标签": "霞谷", "二级标签": "" },
  // no.54
  { "光翼名字": "l_Sunset_2", "一级标签": "霞谷", "二级标签": "" },
  // no.55
  { "光翼名字": "l_Sunset_Citadel_0", "一级标签": "霞谷", "二级标签": "" },
  // no.56
  { "光翼名字": "l_Sunset_Citadel_1", "一级标签": "霞谷", "二级标签": "" },
  // no.57
  { "光翼名字": "l_Sunset_FlyRace_0", "一级标签": "霞谷", "二级标签": "" },
  // no.58
  { "光翼名字": "l_Sunset_FlyRace_1", "一级标签": "霞谷", "二级标签": "" },
  // no.59
  { "光翼名字": "l_SunsetEnd_0", "一级标签": "霞谷", "二级标签": "" },
  // no.60
  { "光翼名字": "l_SunsetEnd2_0", "一级标签": "霞谷", "二级标签": "" },
  // no.61
  { "光翼名字": "l_SunsetRace_0", "一级标签": "霞谷", "二级标签": "" },
  // no.62
  { "光翼名字": "l_Rain_0", "一级标签": "雨林", "二级标签": "" },
  // no.63
  { "光翼名字": "l_Rain_1", "一级标签": "雨林", "二级标签": "" },
  // no.64
  { "光翼名字": "l_Rain_Cave_0", "一级标签": "雨林", "二级标签": "" },
  // no.65
  { "光翼名字": "l_Rain_Cave_1", "一级标签": "雨林", "二级标签": "" },
  // no.66
  { "光翼名字": "l_Rain_Cave_2", "一级标签": "雨林", "二级标签": "" },
  // no.67
  { "光翼名字": "l_Rain_Cave_3", "一级标签": "雨林", "二级标签": "" },
  // no.68
  { "光翼名字": "l_RainEnd_0", "一级标签": "雨林", "二级标签": "" },
  // no.69
  { "光翼名字": "l_RainForest_0", "一级标签": "雨林", "二级标签": "" },
  // no.70
  { "光翼名字": "l_RainForest_1", "一级标签": "雨林", "二级标签": "" },
  // no.71
  { "光翼名字": "l_RainForest_2", "一级标签": "雨林", "二级标签": "" },
  // no.72
  { "光翼名字": "l_RainForest_3", "一级标签": "雨林", "二级标签": "" },
  // no.73
  { "光翼名字": "l_RainMid_0", "一级标签": "雨林", "二级标签": "" },
  // no.74
  { "光翼名字": "l_RainMid_1", "一级标签": "雨林", "二级标签": "" },
  // no.75
  { "光翼名字": "l_RainMid_2", "一级标签": "雨林", "二级标签": "" },
  // no.76
  { "光翼名字": "l_RainShelter_0", "一级标签": "雨林", "二级标签": "" },
  // no.77
  { "光翼名字": "l_RainShelter_1", "一级标签": "雨林", "二级标签": "" },
  // no.78
  { "光翼名字": "l_Rain_BaseCamp_0", "一级标签": "雨林", "二级标签": "集结季" },
  // no.79
  { "光翼名字": "l_Rain_BaseCamp_1", "一级标签": "雨林", "二级标签": "集结季" },
  // no.80
  { "光翼名字": "l_DayHubCave_0", "一级标签": "云野", "二级标签": "" },
  // no.81
  { "光翼名字": "l_Prairie_ButterflyFields_0", "一级标签": "云野", "二级标签": "" },
  // no.82
  { "光翼名字": "l_Prairie_ButterflyFields_1", "一级标签": "云野", "二级标签": "" },
  // no.83
  { "光翼名字": "l_Prairie_ButterflyFields_2", "一级标签": "云野", "二级标签": "" },
  // no.84
  { "光翼名字": "l_Prairie_Cave_0", "一级标签": "云野", "二级标签": "" },
  // no.85
  { "光翼名字": "l_Prairie_Cave_1", "一级标签": "云野", "二级标签": "" },
  // no.86
  { "光翼名字": "l_Prairie_Island_0", "一级标签": "云野", "二级标签": "圣岛季" },
  // no.87
  { "光翼名字": "l_Prairie_Island_1", "一级标签": "云野", "二级标签": "圣岛季" },
  // no.88
  { "光翼名字": "l_Prairie_Island_2", "一级标签": "云野", "二级标签": "圣岛季" },
  // no.89
  { "光翼名字": "l_Prairie_Island_3", "一级标签": "云野", "二级标签": "圣岛季" },
  // no.90
  { "光翼名字": "l_Prairie_Island_4", "一级标签": "云野", "二级标签": "圣岛季" },
  // no.91
  { "光翼名字": "l_Prairie_Island_5", "一级标签": "云野", "二级标签": "圣岛季" },
  // no.92
  { "光翼名字": "l_Prairie_Island_6", "一级标签": "云野", "二级标签": "圣岛季" },
  // no.93
  { "光翼名字": "l_Prairie_Island_7", "一级标签": "云野", "二级标签": "圣岛季" },
  // no.94
  { "光翼名字": "l_Prairie_NestAndKeeper_0", "一级标签": "云野", "二级标签": "" },
  // no.95
  { "光翼名字": "l_Prairie_NestAndKeeper_1", "一级标签": "云野", "二级标签": "" },
  // no.96
  { "光翼名字": "l_Prairie_Village_0", "一级标签": "云野", "二级标签": "" },
  // no.97
  { "光翼名字": "l_Prairie_Village_1", "一级标签": "云野", "二级标签": "" },
  // no.98
  { "光翼名字": "l_Prairie_Village_2", "一级标签": "云野", "二级标签": "" },
  // no.99
  { "光翼名字": "l_Prairie_Village_3", "一级标签": "云野", "二级标签": "" },
  // no.100
  { "光翼名字": "l_Prairie_Village_4", "一级标签": "云野", "二级标签": "" },
  // no.101
  { "光翼名字": "s_wise", "一级标签": "复刻永久", "二级标签": "" },
  // no.102
  { "光翼名字": "s_welcome", "一级标签": "复刻永久", "二级标签": "" },
  // no.103
  { "光翼名字": "s_sparkler", "一级标签": "复刻永久", "二级标签": "" },
  // no.104
  { "光翼名字": "s_shrug", "一级标签": "复刻永久", "二级标签": "" },
  // no.105
  { "光翼名字": "s_shh", "一级标签": "复刻永久", "二级标签": "" },
  // no.106
  { "光翼名字": "s_sass", "一级标签": "复刻永久", "二级标签": "" },
  // no.107
  { "光翼名字": "s_sarcastic", "一级标签": "复刻永久", "二级标签": "" },
  // no.108
  { "光翼名字": "s_salutation", "一级标签": "复刻永久", "二级标签": "" },
  // no.109
  { "光翼名字": "s_respect", "一级标签": "复刻永久", "二级标签": "" },
  // no.110
  { "光翼名字": "s_loopdance", "一级标签": "复刻永久", "二级标签": "" },
  // no.111
  { "光翼名字": "s_lazycool", "一级标签": "复刻永久", "二级标签": "" },
  // no.112
  { "光翼名字": "s_kungfu", "一级标签": "复刻永久", "二级标签": "" },
  // no.113
  { "光翼名字": "s_juggle", "一级标签": "复刻永久", "二级标签": "" },
  // no.114
  { "光翼名字": "s_joy", "一级标签": "复刻永久", "二级标签": "" },
  // no.115
  { "光翼名字": "s_hairtousle", "一级标签": "复刻永久", "二级标签": "" },
  // no.116
  { "光翼名字": "s_kiss", "一级标签": "复刻永久", "二级标签": "" },
  // no.117
  { "光翼名字": "s_dontgo", "一级标签": "复刻永久", "二级标签": "" },
  // no.118
  { "光翼名字": "s_doublefive", "一级标签": "复刻永久", "二级标签": "" },
  // no.119
  { "光翼名字": "s_crabvoice", "一级标签": "复刻永久", "二级标签": "" },
  // no.120
  { "光翼名字": "s_celebrate", "一级标签": "复刻永久", "二级标签": "" },
  // no.121
  { "光翼名字": "s_carry", "一级标签": "复刻永久", "二级标签": "" },
  // no.122
  { "光翼名字": "s_acknowledge", "一级标签": "复刻永久", "二级标签": "" },
  // no.123
  { "光翼名字": "s_crabwalk", "一级标签": "复刻永久", "二级标签": "" },
  // no.124
  { "光翼名字": "s_tripleaxel", "一级标签": "复刻永久", "二级标签": "" },
  // no.125
  { "光翼名字": "s_yawn", "一级标签": "普通永久", "二级标签": "" },
  // no.126
  { "光翼名字": "s_wipe", "一级标签": "普通永久", "二级标签": "" },
  // no.127
  { "光翼名字": "s_whale", "一级标签": "普通永久", "二级标签": "" },
  // no.128
  { "光翼名字": "s_wave_02", "一级标签": "普通永久", "二级标签": "" },
  // no.129
  { "光翼名字": "s_wave", "一级标签": "普通永久", "二级标签": "" },
  // no.130
  { "光翼名字": "s_thumbsup", "一级标签": "普通永久", "二级标签": "" },
  // no.131
  { "光翼名字": "s_strong", "一级标签": "普通永久", "二级标签": "" },
  // no.132
  { "光翼名字": "s_sorry", "一级标签": "普通永久", "二级标签": "" },
  // no.133
  { "光翼名字": "s_sneaky", "一级标签": "普通永久", "二级标签": "" },
  // no.134
  { "光翼名字": "s_shy", "一级标签": "普通永久", "二级标签": "" },
  // no.135
  { "光翼名字": "s_seek", "一级标签": "普通永久", "二级标签": "" },
  // no.136
  { "光翼名字": "s_scared", "一级标签": "普通永久", "二级标签": "" },
  // no.137
  { "光翼名字": "s_salute", "一级标签": "普通永久", "二级标签": "" },
  // no.138
  { "光翼名字": "s_proud_02", "一级标签": "普通永久", "二级标签": "" },
  // no.139
  { "光翼名字": "s_proud", "一级标签": "普通永久", "二级标签": "" },
  // no.140
  { "光翼名字": "s_pray_02", "一级标签": "普通永久", "二级标签": "" },
  // no.141
  { "光翼名字": "s_pray", "一级标签": "普通永久", "二级标签": "" },
  // no.142
  { "光翼名字": "s_pout_02", "一级标签": "普通永久", "二级标签": "" },
  // no.143
  { "光翼名字": "s_pout", "一级标签": "普通永久", "二级标签": "" },
  // no.144
  { "光翼名字": "s_point", "一级标签": "普通永久", "二级标签": "" },
  // no.145
  { "光翼名字": "s_ohno_02", "一级标签": "普通永久", "二级标签": "" },
  // no.146
  { "光翼名字": "s_ohno", "一级标签": "普通永久", "二级标签": "" },
  // no.147
  { "光翼名字": "s_nothanks", "一级标签": "普通永久", "二级标签": "" },
  // no.148
  { "光翼名字": "s_manta", "一级标签": "普通永久", "二级标签": "" },
  // no.149
  { "光翼名字": "s_love", "一级标签": "普通永久", "二级标签": "" },
  // no.150
  { "光翼名字": "s_lookaround", "一级标签": "普通永久", "二级标签": "" },
  // no.151
  { "光翼名字": "s_laugh", "一级标签": "普通永久", "二级标签": "" },
  // no.152
  { "光翼名字": "s_handstand", "一级标签": "普通永久", "二级标签": "" },
  // no.153
  { "光翼名字": "s_ghost", "一级标签": "普通永久", "二级标签": "" },
  // no.154
  { "光翼名字": "s_force", "一级标签": "普通永久", "二级标签": "" },
  // no.155
  { "光翼名字": "s_float", "一级标签": "普通永久", "二级标签": "" },
  // no.156
  { "光翼名字": "s_die", "一级标签": "普通永久", "二级标签": "" },
  // no.157
  { "光翼名字": "s_cry_02", "一级标签": "普通永久", "二级标签": "" },
  // no.158
  { "光翼名字": "s_cry", "一级标签": "普通永久", "二级标签": "" },
  // no.159
  { "光翼名字": "s_come", "一级标签": "普通永久", "二级标签": "" },
  // no.160
  { "光翼名字": "s_cold", "一级标签": "普通永久", "二级标签": "" },
  // no.161
  { "光翼名字": "s_cheer", "一级标签": "普通永久", "二级标签": "" },
  // no.162
  { "光翼名字": "s_butterfly_02", "一级标签": "普通永久", "二级标签": "" },
  // no.163
  { "光翼名字": "s_butterfly", "一级标签": "普通永久", "二级标签": "" },
  // no.164
  { "光翼名字": "s_brave_02", "一级标签": "普通永久", "二级标签": "" },
  // no.165
  { "光翼名字": "s_brave", "一级标签": "普通永久", "二级标签": "" },
  // no.166
  { "光翼名字": "s_bow", "一级标签": "普通永久", "二级标签": "" },
  // no.167
  { "光翼名字": "s_bird", "一级标签": "普通永久", "二级标签": "" },
  // no.168
  { "光翼名字": "s_beacon", "一级标签": "普通永久", "二级标签": "" },
  // no.169
  { "光翼名字": "s_backflip", "一级标签": "普通永久", "二级标签": "" },
  // no.170
  { "光翼名字": "s_playfight", "一级标签": "复刻永久", "二级标签": "" },
  // no.171
  { "光翼名字": "s_nod", "一级标签": "复刻永久", "二级标签": "" },
  // no.172
  { "光翼名字": "s_bellyscratch", "一级标签": "复刻永久", "二级标签": "" },
  // no.173
  { "光翼名字": "s_dance", "一级标签": "复刻永久", "二级标签": "" },
  // no.174
  { "光翼名字": "l_NightDesert_0", "一级标签": "禁阁", "二级标签": "小王子季" },
  // no.175
  { "光翼名字": "l_NightDesert_1", "一级标签": "禁阁", "二级标签": "小王子季" },
  // no.176
  { "光翼名字": "l_NightDesert_2", "一级标签": "禁阁", "二级标签": "小王子季" },
  // no.177
  { "光翼名字": "s_scare", "一级标签": "复刻永久", "二级标签": "" },
  // no.178
  { "光翼名字": "s_gratitude", "一级标签": "复刻永久", "二级标签": "" },
  // no.179
  { "光翼名字": "s_balance", "一级标签": "复刻永久", "二级标签": "" },
  // no.180
  { "光翼名字": "s_jelly", "一级标签": "复刻永久", "二级标签": "" },
  // no.181
  { "光翼名字": "s_grumpy", "一级标签": "复刻永久", "二级标签": "" },
  // no.182
  { "光翼名字": "s_doze", "一级标签": "复刻永久", "二级标签": "" },
  // no.183
  { "光翼名字": "l_Skyway_0", "一级标签": "雨林", "二级标签": "风行季" },
  // no.184
  { "光翼名字": "s_timid", "一级标签": "复刻永久", "二级标签": "" },
  // no.185
  { "光翼名字": "s_seek_02", "一级标签": "普通永久", "二级标签": "" },
  // no.186
  { "光翼名字": "s_handstand_02", "一级标签": "普通永久", "二级标签": "" },
  // no.187
  { "光翼名字": "s_dustoff", "一级标签": "复刻永久", "二级标签": "" },
  // no.188
  { "光翼名字": "s_deepbreath", "一级标签": "复刻永久", "二级标签": "" },
  // no.189
  { "光翼名字": "s_chestpound", "一级标签": "复刻永久", "二级标签": "" },
  // no.190
  { "光翼名字": "l_Dusk_Triangle_0", "一级标签": "暮土", "二级标签": "潜海季" },
  // no.191
  { "光翼名字": "l_Dusk_Triangle_1", "一级标签": "暮土", "二级标签": "潜海季" },
  // no.192
  { "光翼名字": "s_peek", "一级标签": "复刻永久", "二级标签": "" },
  // no.193
  { "光翼名字": "s_bearhug", "一级标签": "复刻永久", "二级标签": "" },
  // no.194
  { "光翼名字": "l_Sunset_Theater_0", "一级标签": "霞谷", "二级标签": "表演季" },
  // no.195
  { "光翼名字": "s_spintrick", "一级标签": "复刻永久", "二级标签": "" },
  // no.196
  { "光翼名字": "s_ghost_02", "一级标签": "普通永久", "二级标签": "" },
  // no.197
  { "光翼名字": "s_rally", "一级标签": "复刻永久", "二级标签": "" },
  // no.198
  { "光翼名字": "s_marching", "一级标签": "复刻永久", "二级标签": "" },
  // no.199
  { "光翼名字": "l_StormEvent_VoidSpace_2", "一级标签": "破晓季", "二级标签": "" },
  // no.200
  { "光翼名字": "l_StormEvent_VoidSpace_1", "一级标签": "破晓季", "二级标签": "" },
  // no.201
  { "光翼名字": "l_StormEvent_VoidSpace_0", "一级标签": "破晓季", "二级标签": "" },
  // no.202
  { "光翼名字": "s_think", "一级标签": "复刻永久", "二级标签": "" },
  // no.203
  { "光翼名字": "l_StormEvent_VoidSpace_3", "一级标签": "破晓季", "二级标签": "" },
  // no.204
  { "光翼名字": "l_StormEvent_VoidSpace_4", "一级标签": "破晓季", "二级标签": "" },
  // no.205
  { "光翼名字": "l_StormEvent_VoidSpace_5", "一级标签": "破晓季", "二级标签": "" },
  // no.206
  { "光翼名字": "s_bubbles", "一级标签": "复刻永久", "二级标签": "" },
  // no.207
  { "光翼名字": "s_eww", "一级标签": "复刻永久", "二级标签": "" },
  // no.208
  { "光翼名字": "s_gloat", "一级标签": "复刻永久", "二级标签": "" },
  // no.209
  { "光翼名字": "l_Night_Shelter_0", "一级标签": "禁阁", "二级标签": "追忆季" },
  // no.210
  { "光翼名字": "s_stretch", "一级标签": "复刻永久", "二级标签": "" },
  // no.211
  { "光翼名字": "s_sneaky_02", "一级标签": "普通永久", "二级标签": "" },
  // no.212
  { "光翼名字": "s_chuckle", "一级标签": "复刻永久", "二级标签": "" },
  // no.213
  { "光翼名字": "s_facepalm", "一级标签": "复刻永久", "二级标签": "" },
  // no.214
  { "光翼名字": "s_tsktsk", "一级标签": "复刻永久", "二级标签": "" },
  // no.215
  { "光翼名字": "s_beckon", "一级标签": "复刻永久", "二级标签": "" },
  // no.216
  { "光翼名字": "s_scheme", "一级标签": "复刻永久", "二级标签": "" },
  // no.217
  { "光翼名字": "l_Prairie_WildLifePark_0", "一级标签": "云野", "二级标签": "拾光季" },
  // no.218
  { "光翼名字": "l_Prairie_WildLifePark_1", "一级标签": "云野", "二级标签": "拾光季" },
  // no.219
  { "光翼名字": "l_Prairie_WildLifePark_2", "一级标签": "云野", "二级标签": "拾光季" },
  // no.220
  { "光翼名字": "s_sneeze", "一级标签": "复刻永久", "二级标签": "" },
  // no.221
  { "光翼名字": "s_nerdy", "一级标签": "复刻永久", "二级标签": "" },
  // no.222
  { "光翼名字": "s_slouch", "一级标签": "复刻永久", "二级标签": "" },
  // no.223
  { "光翼名字": "s_voila", "一级标签": "复刻永久", "二级标签": "" },
  // no.224
  { "光翼名字": "l_Night_PaintedWorld_0", "一级标签": "禁阁", "二级标签": "九色鹿季" },
  // no.225
  { "光翼名字": "l_Night_PaintedWorld_1", "一级标签": "禁阁", "二级标签": "九色鹿季" },
  // no.226
  { "光翼名字": "s_evillaugh", "一级标签": "复刻永久", "二级标签": "" },
  // no.227
  { "光翼名字": "s_pointup", "一级标签": "复刻永久", "二级标签": "" },
  // no.228
  { "光翼名字": "s_showdance", "一级标签": "复刻永久", "二级标签": "" },
  // no.229
  { "光翼名字": "s_handshake", "一级标签": "复刻永久", "二级标签": "" },
  // no.230
  { "光翼名字": "s_anxious", "一级标签": "复刻永久", "二级标签": "" },
  // no.231
  { "光翼名字": "l_Night_PaintedWorld_2", "一级标签": "禁阁", "二级标签": "九色鹿季" },
  // no.232
  { "光翼名字": "s_babymanta", "一级标签": "复刻永久", "二级标签": "" },
  // no.233
  { "光翼名字": "s_lightvoidspace01", "一级标签": "复刻永久", "二级标签": "" },
  // no.234
  { "光翼名字": "s_lightvoidspace02", "一级标签": "复刻永久", "二级标签": "" },
  // no.235
  { "光翼名字": "s_darkvoidspace02", "一级标签": "复刻永久", "二级标签": "" },
  // no.236
  { "光翼名字": "s_darkvoidspace01", "一级标签": "复刻永久", "二级标签": "" },
  // no.237
  { "光翼名字": "s_headbob", "一级标签": "复刻永久", "二级标签": "" },
  // no.238
  { "光翼名字": "l_Night_StoryBook_0", "一级标签": "禁阁", "二级标签": "姆明季" },
  // no.239
  { "光翼名字": "s_hackysack", "一级标签": "复刻永久", "二级标签": "" },
  // no.240
  { "光翼名字": "s_plead", "一级标签": "复刻永久", "二级标签": "" },
  // no.241
  { "光翼名字": "s_duetdance", "一级标签": "复刻永久", "二级标签": "" },
  // no.242
  { "光翼名字": "s_awww", "一级标签": "复刻永久", "二级标签": "" },
  // no.243
  { "光翼名字": "s_twirl", "一级标签": "复刻永久", "二级标签": "" },
  // no.244
  { "光翼名字": "s_ouch", "一级标签": "复刻永久", "二级标签": "" },
  // no.245
  { "光翼名字": "l_Rain_BlueBirdTheater_0", "一级标签": "雨林", "二级标签": "青鸟季" },
  // no.246
  { "光翼名字": "s_roll", "一级标签": "复刻永久", "二级标签": "" },
  // no.247
  { "光翼名字": "s_tiptoe", "一级标签": "复刻永久", "二级标签": "" },
  // no.248
  { "光翼名字": "s_injured", "一级标签": "复刻永久", "二级标签": "" },
  // no.249
  { "光翼名字": "s_wait", "一级标签": "复刻永久", "二级标签": "" },
  // no.250
  { "光翼名字": "s_jollydance", "一级标签": "复刻永久", "二级标签": "" },
  // no.251
  { "光翼名字": "l_Dawn_6", "一级标签": "晨岛", "二级标签": "迁徙季" },
  // no.252
  { "光翼名字": "l_Skyway_1", "一级标签": "雨林", "二级标签": "迁徙季" },
  // no.253
  { "光翼名字": "s_windpose", "一级标签": "复刻永久", "二级标签": "" },
  // no.254
  { "光翼名字": "s_nightbird", "一级标签": "复刻永久", "二级标签": "" },
  // no.255
  { "光翼名字": "s_raisetheroof", "一级标签": "复刻永久", "二级标签": "" },
  // no.256
  { "光翼名字": "l_MainStreet_FunArmada_0", "一级标签": "狂欢船队", "二级标签": "狂欢季" },
  // no.257
  { "光翼名字": "l_MainStreet_FunArmada_1", "一级标签": "狂欢船队", "二级标签": "狂欢季" },
  // no.258
  { "光翼名字": "s_mope", "一级标签": "复刻永久", "二级标签": "" },
];

// 三个网易json里面没有 但是frida api拿出来有的
export const ExtraWingTagMap = [
  {"光翼名字":"l_MainStreet_0","一级标签":"云巢","二级标签":"小黑屋"},
  {"光翼名字":"l_CandleSpace_0","一级标签":"遇境","二级标签":"小黑屋"},
  {"光翼名字":"l_SunsetEnd_1","一级标签":"霞谷","二级标签":"旧版终点"},
] as const;
